cfg/InformationRegisters/ВоинскийУчет.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>ВоинскийУчет</Name>
			<Comment>(Регл)</Comment>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ОтношениеКВоинскойОбязанности</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ОтношениеКВоинскойОбязанности</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОтношениеКВоинскомуУчету</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ОтношениеКВоинскомуУчету</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Звание</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВоинскиеЗвания</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВУС</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Годность</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ГодностьКВоеннойСлужбе</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Военкомат</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Военкоматы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НаличиеМобпредписания</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗабронированОрганизацией</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОснованиеНегодности</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СпецУчет</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ГруппаДо2016</Name>
					<Comment>Группа (до даты вступления в силу порядка №921 от 07.12.16 г.)</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ГруппыВоинскогоУчета</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Категория</Name>
					<Type>
						<v8:Type>cfg:EnumRef.КатегорииВоинскогоУчета</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Профиль</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПрофилиОфицеров</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаИНомерПриказаОПризыве</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СрокКонтракта</Name>
					<Comment>Для службы по контракту</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВоенкоматФМП</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Военкоматы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Группа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РеквизитыВоенногоБилета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>60</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Физлицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cfg/Enums/СоставыВоеннослужащих.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Enum>
		<Properties>
			<Name>СоставыВоеннослужащих</Name>
			<Comment>(Регл)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Рядовой</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СержантскийИСтаршинский</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрапорщиковИМичманов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МладшиеОфицеры</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СтаршиеОфицеры</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВысшиеОфицеры</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

cfg/Enums/ОтношениеКВоинскойОбязанности.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Enum>
		<Properties>
			<Name>ОтношениеКВоинскойОбязанности</Name>
			<Comment>(Регл)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Военнообязанный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеВоеннообязанный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Призывник</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

cfg/Enums/ОтношениеКВоинскомуУчету.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Enum>
		<Properties>
			<Name>ОтношениеКВоинскомуУчету</Name>
			<Comment>(Регл)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Состоит</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Встает</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеСостоит</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СнятПоВозрасту</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СнятПоСостояниюЗдоровья</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПризванНаВоинскуюСлужбу</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СлужбаПоКонтракту</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

cfg/Enums/ГодностьКВоеннойСлужбе.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Enum>
		<Properties>
			<Name>ГодностьКВоеннойСлужбе</Name>
			<Comment>(Регл)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Годен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеГоден</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГоденКНестроевой</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВременноНегоден</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

cfg/InformationRegisters/ВоинскийУчет/Forms/ФормаЗаписиДополнительная/Ext/Form/Module.bsl
// Устанавливает доступность реквизитов, выполняет необходимую очистку 
//		значений в соответствии с логикой заполнения
Процедура УстановитьДоступность()

	Состав = Звание.Состав; // звание могло измениться
	ЭлементыФормы.Состав.Значение = Состав;
	
    Офицер		= (Состав = Перечисления.СоставыВоеннослужащих.МладшиеОфицеры
					или Состав = Перечисления.СоставыВоеннослужащих.СтаршиеОфицеры
					или Состав = Перечисления.СоставыВоеннослужащих.ВысшиеОфицеры);
    Призывник	= (ОтношениеКВоинскойОбязанности = Перечисления.ОтношениеКВоинскойОбязанности.Призывник);
	Состоит 	= не (ОтношениеКВоинскойОбязанности = Перечисления.ОтношениеКВоинскойОбязанности.НеВоеннообязанный
					или ОтношениеКВоинскомуУчету = Перечисления.ОтношениеКВоинскомуУчету.НеСостоит);
	Снят	 	= (ОтношениеКВоинскомуУчету = Перечисления.ОтношениеКВоинскомуУчету.СнятПоВозрасту
					или ОтношениеКВоинскомуУчету = Перечисления.ОтношениеКВоинскомуУчету.СнятПоСостояниюЗдоровья);
    Годен		= Годность = Перечисления.ГодностьКВоеннойСлужбе.Годен;

	ЭлементыФормы.Годность.Доступность
		= Состоит и (не Офицер) и (не Призывник);
	ЭлементыФормы.Звание.Доступность
		= Состоит и (не Призывник);
	ЭлементыФормы.ЗабронированОрганизацией.Доступность
		= Состоит и (не Призывник);
	ЭлементыФормы.НаличиеМобпредписания.Доступность
		= Состоит и (не Призывник);
	ЭлементыФормы.Военкомат.Доступность
		= Состоит;
	ЭлементыФормы.ВоенкоматФМП.Доступность
		= Состоит;
	ЭлементыФормы.ОснованиеНегодности.Доступность
		= Состоит и (((не Офицер) и (не Годен)) или (Офицер и Снят))  и (не Призывник);
	ЭлементыФормы.ВУС.Доступность
		= Состоит и (не Призывник);
	ЭлементыФормы.СпецУчет.Доступность
		= Состоит;
	ЭлементыФормы.Группа.Доступность
		= Состоит и (не Офицер) и (не Призывник);
	ЭлементыФормы.ГруппаДо2016.Доступность
		= Состоит и (не Офицер) и (не Призывник);
	ЭлементыФормы.Категория.Доступность
		= Состоит и (не Призывник);
	ЭлементыФормы.Профиль.Доступность
		= Состоит и Офицер и (не Призывник);
	ЭлементыФормы.ДатаИНомерПриказаОПризыве.Доступность = (ОтношениеКВоинскомуУчету = Перечисления.ОтношениеКВоинскомуУчету.ПризванНаВоинскуюСлужбу
		ИЛИ ОтношениеКВоинскомуУчету = Перечисления.ОтношениеКВоинскомуУчету.СлужбаПоКонтракту);
	ЭлементыФормы.СрокКонтракта.Доступность = (ОтношениеКВоинскомуУчету = Перечисления.ОтношениеКВоинскомуУчету.СлужбаПоКонтракту);

	Для каждого Ресурс Из Метаданные.РегистрыСведений.ВоинскийУчет.Ресурсы Цикл

		ИмяРесурса = Ресурс.Имя;

        // очистим неиспользуемые значения
		Если (не ЭлементыФормы[ИмяРесурса].Доступность) Тогда

			Если ТипЗнч(РегистрСведенийМенеджерЗаписи[ИмяРесурса]) = Тип("Булево") Тогда
				Если РегистрСведенийМенеджерЗаписи[ИмяРесурса] Тогда
			
					РегистрСведенийМенеджерЗаписи[ИмяРесурса] = Ложь;

				КонецЕсли;
			ИначеЕсли ЗначениеЗаполнено(РегистрСведенийМенеджерЗаписи[ИмяРесурса]) Тогда
			
				РегистрСведенийМенеджерЗаписи[ИмяРесурса] = NULL;
				
			КонецЕсли; 
		КонецЕсли; 

		// доступность надписей
		Если ТипЗнч(ЭлементыФормы[ИмяРесурса]) = Тип("ПолеВвода") Тогда
		
			ЭлементыФормы["Надпись"+ИмяРесурса].Доступность = ЭлементыФормы[ИмяРесурса].Доступность;
		
		КонецЕсли; 
	
	КонецЦикла;

	

КонецПроцедуры // УстановитьДоступность()


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

Процедура ПриОткрытии()
	
	ФизЛицоПриОткрытии    			         = ФизЛицо;
	ПериодПриОткрытии   					 = Период;
	ВоенкоматПриОткрытии 					 = Военкомат;
	ВоенкоматФМППриОткрытии 				 = ВоенкоматФМП;
	ВУСПриОткрытии           				 = ВУС;
	РеквизитыВоенногоБилетаПриОткрытии       = РеквизитыВоенногоБилета;
	ГодностьПриОткрытии   		 			 = Годность;
	ЗабронированОрганизациейПриОткрытии 	 = ЗабронированОрганизацией;
	ЗваниеПриОткрытии             			 = Звание;
	НаличиеМобпредписанияПриОткрытии   		 = НаличиеМобпредписания;
	ОтношениеКВоинскойОбязанностиПриОткрытии = ОтношениеКВоинскойОбязанности;
	ОтношениеКВоинскомуУчетуПриОткрытии      = ОтношениеКВоинскомуУчету;
	ОснованиеНегодностиПриОткрытии      	 = ОснованиеНегодности;
	СпецУчетПриОткрытии  				     = СпецУчет;
	ГруппаПриОткрытии      					 = Группа;
	ГруппаДо2016ПриОткрытии      			 = ГруппаДо2016;
	КатегорияПриОткрытии				     = Категория;
	ПрофильПриОткрытии      				 = Профиль;
	ДатаИНомерПриказаОПризывеПриОткрытии	 = ДатаИНомерПриказаОПризыве;
	        
	Заголовок = Заголовок + " " + ФизЛицо.Наименование;
	
	Прочитать();
	
	// У записи обязательно должны быть заполнены реквизиты ФизЛицо и Период
	Если ФизЛицо.Пустая() Тогда
	    ФизЛицо = ФизЛицоПриОткрытии;
		Период  = ПериодПриОткрытии;
	КонецЕсли;
	
	УстановитьДоступность();
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	// Если поменяли дату, то тогда новая  запись
	Если ПериодПриОткрытии <> Период Тогда
		
		// Если что-то поменяли тогда запишем 
		Если ВоенкоматПриОткрытии <> Военкомат ИЛИ
			 ВоенкоматФМППриОткрытии <> ВоенкоматФМП ИЛИ
			 ВУСПриОткрытии <> ВУС ИЛИ
			 РеквизитыВоенногоБилетаПриОткрытии <> РеквизитыВоенногоБилета ИЛИ
			 ГодностьПриОткрытии <> Годность ИЛИ
			 ЗабронированОрганизациейПриОткрытии <> ЗабронированОрганизацией ИЛИ
			 ЗваниеПриОткрытии <> Звание ИЛИ
			 НаличиеМобпредписанияПриОткрытии <> НаличиеМобпредписания ИЛИ
			 ОтношениеКВоинскойОбязанностиПриОткрытии <> ОтношениеКВоинскойОбязанности ИЛИ
			 ОтношениеКВоинскомуУчетуПриОткрытии <> ОтношениеКВоинскомуУчету ИЛИ
			 ОснованиеНегодностиПриОткрытии <> ОснованиеНегодности ИЛИ
			 СпецУчетПриОткрытии <> СпецУчет ИЛИ
			 ГруппаПриОткрытии <> Группа ИЛИ
			 ГруппаДо2016ПриОткрытии <> ГруппаДо2016 ИЛИ
			 КатегорияПриОткрытии <> Категория ИЛИ
			 ПрофильПриОткрытии <> Профиль ИЛИ
			 ДатаИНомерПриказаОПризывеПриОткрытии <> ДатаИНомерПриказаОПризыве
			 Тогда
		
			МенеджерЗаписи = РегистрыСведений.ВоинскийУчет.СоздатьМенеджерЗаписи();
			МенеджерЗаписи.Период  						 = Период;
			МенеджерЗаписи.ФизЛицо 						 = ФизЛицо;
			МенеджерЗаписи.Военкомат					 = Военкомат;
			МенеджерЗаписи.ВоенкоматФМП					 = ВоенкоматФМП;
			МенеджерЗаписи.ВУС							 = ВУС;
			МенеджерЗаписи.РеквизитыВоенногоБилета		 = РеквизитыВоенногоБилета;
			МенеджерЗаписи.Годность						 = Годность;
			МенеджерЗаписи.ЗабронированОрганизацией		 = ЗабронированОрганизацией;
			МенеджерЗаписи.Звание 						 = Звание;
			МенеджерЗаписи.НаличиеМобпредписания		 = НаличиеМобпредписания;
			МенеджерЗаписи.ОтношениеКВоинскойОбязанности = ОтношениеКВоинскойОбязанности;
			МенеджерЗаписи.ОтношениеКВоинскомуУчету		 = ОтношениеКВоинскомуУчету;
			МенеджерЗаписи.ОснованиеНегодности			 = ОснованиеНегодности;
			МенеджерЗаписи.СпецУчет						 = СпецУчет;
			МенеджерЗаписи.Группа						 = Группа;
			МенеджерЗаписи.ГруппаДо2016					 = ГруппаДо2016;
			МенеджерЗаписи.Категория		 			 = Категория;
			МенеджерЗаписи.Профиль						 = Профиль;
			МенеджерЗаписи.ДатаИНомерПриказаОПризыве     = ДатаИНомерПриказаОПризыве;
			
			МенеджерЗаписи.Записать();
			
		КонецЕсли; 
	
	КонецЕсли;
	
КонецПроцедуры

Процедура ПослеЗаписи()
	Оповестить("ОбновитьФорму", Новый Структура("ИмяЭлемента","ВоинскийУчет"), ФизЛицо);
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ

Процедура КнопкаИсторияНажатие(Элемент)
	
	ФормаРегистра = РегистрыСведений.ВоинскийУчет.ПолучитьФормуСписка();
	ФормаРегистра.РегистрСведенийСписок.Отбор.ФизЛицо.Значение = ФизЛицо;
	ФормаРегистра.РегистрСведенийСписок.Отбор.ФизЛицо.ВидСравнения = ВидСравнения.Равно;
	ФормаРегистра.РегистрСведенийСписок.Отбор.ФизЛицо.Использование = Истина;
	ФормаРегистра.ЭлементыФормы.РегистрСведенийСписок.НачальноеОтображениеСписка = НачальноеОтображениеСписка.Конец;
	
	ФормаРегистра.Открыть();
	
КонецПроцедуры

Процедура ЗваниеПриИзменении(Элемент)
	Состав = Звание.Состав;
	УстановитьДоступность();
КонецПроцедуры

Процедура ОтношениеКВоинскойОбязанностиПриИзменении(Элемент)
	УстановитьДоступность();
КонецПроцедуры

Процедура ОтношениеКВоинскомуУчетуПриИзменении(Элемент)
	УстановитьДоступность();
КонецПроцедуры

Процедура ГодностьПриИзменении(Элемент)
	УстановитьДоступность();
КонецПроцедуры
